/*
문제: 일과를 마치고 돌아온 난쟁이가 일곱 명이 아닌 아홉 명이었던 것이다.
      일곱 난쟁이의 키의 합이 100이 됨을 기억해 냈다.
      아홉 난쟁이의 키가 주어졌을 때, 백설공주를 도와 일곱 난쟁이를 찾는 프로그램을 작성하시오.

입력: 아홉 개의 줄에 걸쳐 난쟁이들의 키가 주어진다. 주어지는 키는 100을 넘지 않는 자연수이며, 아홉 난쟁이의 키는 모두 다르며, 가능한 정답이 여러 가지인 경우에는 아무거나 출력한다.

출력: 일곱 난쟁이의 키를 오름차순으로 출력한다. 일곱 난쟁이를 찾을 수 없는 경우는 없다.
*/

#include<iostream>
#include<algorithm>
using namespace std;
int a[10];
int main() {
	int sum = 0;
	for (int i = 0; i < 9; i++) {
		cin >> a[i];
		sum += a[i];
	}
	sort(a, a + 9); // 오름차순 정렬
	for (int i = 0; i < 9; i++) {
		for (int j = i + 1; j < 9; j++) {
			if ((sum - (a[i] + a[j])) == 100) {
				for (int k = 0; k < 9; k++) {
					if (i == k || j == k) continue; // 우리가 찾은 이상한 난쟁이는 빼고 출력
					cout << a[k] << '\n';
				}
				return 0;
			}
		}
	}
}
